'''
Розробити функцію find_most_frequent(text),
яка приймає 1 аргумент -- текст довільної довжини, який може містити літери латинського алфавіту, 
пробіли та розділові знаки (,.:;!?-);
та повертає список слів (у нижньому регістрі), які зустрічаються в тексті найчастіше.

Слова, записані через дефіс, вважати двома словами (наприклад, "hand-made"). 
Слова у різних відмінках, числах та з іншими перетвореннями (наприклад, "page" та "pages") 
вважаються різними словами. 
Регістр слів -- навпаки, не має значення: слова "page" та "Page" вважаються 1 словом.

Якщо слів, які зустрічаються найчастіше, декілька -- вивести їх в алфавітному порядку.
'''

def find_most_frequent(text):
    text_l = text.lower()
    print (text_l.split())


print (find_most_frequent('Hello,Hello, my dear!'))
